In [ ]:
text file
- csv
- bank_data="C:\\Users\\sunil\\Downloads\\Visadataset - Visadataset.csv"
pd.read_excel(bank_data,sep=';')

- how to creat a data frame

- how to add columns

- how to add rows

- how to drop columns

- how to drop rows

- how to save the dataframe

# method-1

**Create dataframe using List**

# STEP-1:

# Create dataframe using list

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
names=['ramesh','suresh','sathish']
age=[20,25,30]
pd.DataFrame(zip(names,age))

         0   1
0   ramesh  20
1   suresh  25
2  sathish  30

In [30]:
Names=['Ramesh','Suresh','Sathish']
Age=[20,25,30]
df1=pd.DataFrame(zip(Names,Age),
             columns=['Names','age'],
            index=['A','B','C'])

In [31]:
df1['Names']=['Ramesh','Suresh','Sathish']
df1

     Names  age
A   Ramesh   20
B   Suresh   25
C  Sathish   30

In [32]:
df1['city']=['hyd','mumbai','chennai']
df1

     Names  age     city
A   Ramesh   20      hyd
B   Suresh   25   mumbai
C  Sathish   30  chennai

In [24]:
len(df1.index)   #  3 ===> 0 1 2

3

In [33]:
df1.loc[3]=['Alex',35,'hyd']
df1

     Names  age     city
A   Ramesh   20      hyd
B   Suresh   25   mumbai
C  Sathish   30  chennai
3     Alex   35      hyd

In [34]:
df1.loc['A']=['Bunny',40,'delhi']
df1

     Names  age     city
A    Bunny   40    delhi
B   Suresh   25   mumbai
C  Sathish   30  chennai
3     Alex   35      hyd

$step-7$:
    
    Drop the column

In [52]:
Names=['Ramesh','Suresh','Sathish']
Age=[20,25,30]
df1=pd.DataFrame(zip(Names,Age),
             columns=['Names','age'],
            index=[0,1,2])
df1['city']=['hyd','mumbai','chennai']
df1

     Names  age     city
0   Ramesh   20      hyd
1   Suresh   25   mumbai
2  Sathish   30  chennai

In [37]:
# Alex=1   it reference column
# Alex=0   it reference rows
# the result you want to overwrite oy save in another variable
df1.drop('city',
         axis=1,
        inplace=True)

In [55]:
df1

    Names  age    city
0  Ramesh   20     hyd
1  Suresh   25  mumbai

$step-8$:

    Drop the row

In [53]:
df1.drop(2,inplace=True)

In [54]:
df1

    Names  age    city
0  Ramesh   20     hyd
1  Suresh   25  mumbai

In [60]:
# read data file is seperate folder
#      you need to provide path
# write the output seperate folder
#        you need toprobide path
#folder location + name of the file + extension
df1.to_csv("C:\\Users\\sunil\\Downloads\\naresh it\\datascience\\output.csv",index=False)

In [61]:
# first read
pd.read_csv("C:\\Users\\sunil\\Downloads\\naresh it\\datascience\\output.csv")

    Names  age    city
0  Ramesh   20     hyd
1  Suresh   25  mumbai

In [62]:
# same folder
df1.to_csv("output1.csv")

In [63]:
import os
os.getcwd()

'C:\\Users\\sunil\\Downloads\\naresh it\\datascience'

$method-2$:
    
**create a Dataframe using dictionary**

In [67]:
d1={'Names':['Ramesh','Suresh','Sathish'],
   'Age':[20,25,30]}
d1
# keys consider a column names
# values consider a row

{'Names': ['Ramesh', 'Suresh', 'Sathish'], 'Age': [20, 25, 30]}

In [68]:
pd.DataFrame(d1)

     Names  Age
0   Ramesh   20
1   Suresh   25
2  Sathish   30

$method-3$:

In [79]:
df1=pd.DataFrame()
df1

Empty DataFrame
Columns: []
Index: []

In [80]:
import random
even_list=[]
for i in range(5):
    num=random.randint(20,50)
    if num%2==0:
        even_list.append(num)
even_list

[32, 28, 20, 46]

In [81]:
df1['Even']=even_list

In [82]:
df1

   Even
0    32
1    28
2    20
3    46

[28, 42]

In [83]:
df1['odd']=[1,3,5,7]

In [84]:
df1

   Even  odd
0    32    1
1    28    3
2    20    5
3    46    7

In [ ]:
- read the data
- quick checks
- type : list ==== methods
         strings ==== str methods
         dict ==== dict methods
         index ==== has some methods=== convert into other
- head\tail\shape\size\len
- columns/dtypes/info
- cat and num

- take based

In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [11]:
file_location=="C:\\Users\\sunil\\Downloads\\Visadataset - Visadataset.csv"
visa_df=pd.read_csv(file_location)
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [12]:
visa_df.iloc[<rows>,<columns>]
visa_df.iloc[<start:end>,<start:end>]
visa_df.iloc[[rows index],[columns index]]

SyntaxError: invalid syntax (1022828637.py, line 1)

In [13]:
visa_df.iloc[5:10:2:6]
# i want select rows has index

SyntaxError: invalid syntax (2818521405.py, line 1)

In [14]:
rows=[100,200,300]
cols=[2,7]
visa_df.iloc[rows,cols]

    education_of_employee region_of_employment
100              Master's            Northeast
200             Doctorate                 West
300              Master's              Midwest

In [15]:
rows=[100,200,300]
cols=['education_of_employee','region_of_employment']
visa_df.loc[rows,cols]

    education_of_employee region_of_employment
100              Master's            Northeast
200             Doctorate                 West
300              Master's              Midwest

**Note**

- iloc takes only numerical entry,we can not provide column names directly

- loc takes only columns names